app/views/messages/_form.html.erb

      <ul>
        <% message.errors.full_messages.each do |message| %>
---
SELECT "messages".* FROM "messages" ORDER BY "messages"."id" ASC LIMIT $1  [["LIMIT", 1]]