app/controllers/messages_controller.rb

SELECT "messages".* FROM "messages" ORDER BY "messages"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
  def index
    @messages = Message.all