app/controllers/messages_controller.rb

  def index
    @messages = Message.where(:procedure_id => params[:procedure_id]).order(created_at: :asc)
    @procedure = Procedure.find(params[:procedure_id])
---
SELECT "procedures".* FROM "procedures" WHERE "procedures"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @message = Message.new(message_params)
    respond_to do |format|
      if @message.save
        #Create notification
        if current_user.prosecutor.present?
          police_unit_id =  @message.procedure.police_unit_in_charge.id
          police_unit_users = User.where(police_unit_id: police_unit_id)
          police_unit_users.each { |user|
---
INSERT INTO "messages" ("user_id", "procedure_id", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["procedure_id", 1], ["content", "hgtsh"], ["created_at", "2020-11-01 13:55:51.827924"], ["updated_at", "2020-11-01 13:55:51.827924"]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def set_message
      @message = Message.find(params[:id])
---
SELECT "messages".* FROM "messages" WHERE "messages"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]