app/controllers/procedures_controller.rb

  def edit
    @procedure = Procedure.find(params[:id])
---
SELECT "procedures".* FROM "procedures" WHERE "procedures"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]