app/controllers/procedures_controller.rb

SELECT "procedures".* FROM "procedures"
---
  def index
    @procedures = Procedure.all

SELECT "person_in_procedures".* FROM "person_in_procedures" WHERE "person_in_procedures"."procedure_id" = $1 AND "person_in_procedures"."role" = $2  [["procedure_id", 1], ["role", 0]]
SELECT "person_in_procedures".* FROM "person_in_procedures" WHERE "person_in_procedures"."procedure_id" = $1 AND "person_in_procedures"."role" = $2  [["procedure_id", 1], ["role", 1]]
SELECT "person_in_procedures".* FROM "person_in_procedures" WHERE "person_in_procedures"."procedure_id" = $1 AND "person_in_procedures"."role" = $2  [["procedure_id", 1], ["role", 2]]
---
  def show
    #save list with all accuseds person of the procedure
    accuseds_in_procedure = @procedure.person_in_procedures.where(role: 0)
    @accuseds = []
    accuseds_in_procedure.each do |accused|
      @accuseds.append(Person.find(accused.person_id))
    end

    #save list with all victims person of the procedure
    victims_in_procedure = @procedure.person_in_procedures.where(role: 1)
    @victims = []
    victims_in_procedure.each do |victim|
      @victims.append(Person.find(victim.person_id))
    end

    #save list with all witnesses person of the procedure
    witnesses_in_procedure = @procedure.person_in_procedures.where(role: 2)
    @witnesses = []
    witnesses_in_procedure.each do |witness|

SELECT "procedures".* FROM "procedures" WHERE "procedures"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_procedure
      @procedure = Procedure.find(params[:id])